Autodesk.Revit.DB.CategoryType
Since:
2015
The type of category.
Since:
2015

Autodesk.Revit.DB.CategoryType.AnalyticalModel
An analytical model element category.

Autodesk.Revit.DB.CategoryType.Internal
The category is for internal usage.

Autodesk.Revit.DB.CategoryType.Annotation
An annotation element category.

Autodesk.Revit.DB.CategoryType.Model
A model element category.

Autodesk.Revit.DB.CategoryType.Invalid
The category type is invalid.